import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    'Очень крутое место',
    1.23456,
    7.89012,
    'cool.com',
    'Самая большая крутотень из крутотеней, круче которой даже любая крутота крутешная не будет такой крутой.',
    'Природа',
  ),
  Sight(
    'Очень отстойное место',
    1.23456,
    7.89012,
    'shit.com',
    'Самый большой отстой из всех остоев',
    'Бар',
  ),
  Sight(
    'Ну такое себе место',
    1.23456,
    7.89012,
    'sosolala.com',
    'Ну такое себе местечко. Бывает и хуже, конечно, но и получше тоже не мало',
    'Клуб',
  ),
  Sight(
    'Крутая рыбалка',
    1.23456,
    7.89012,
    'coolfishing.com',
    'Карась клюет прямо на берегу, полтонные щуки, бешенные окуни и самые жирные сазаны на свете',
    'Рыбалка',
  ),
  Sight(
    'Фиговая рыбалка',
    1.23456,
    7.89012,
    'shitfishing.com',
    'За полгода здесь клевало всего два раза - ротан и старый ботинок. \nУбить время и никого не поймать - это к нам',
    'Рыбалка',
  ),
];
